# Non-conforming event codes (tail is not a registered action).
# Generated by scripts/code_format.py. Fix = register a new action OR normalize to an existing one.

## Timer/field codes misplaced as events (15) — these are *_due_at Task timers, move out of When/Produced:
  cash.coverage.attestation_due_at
  cash.custody.rotation_due_at
  cash.enterprise_limit.remediation_due_at
  cash.kri.publish_due_at
  cash.overshort.investigation_due_at
  cash.recon.due_at
  cash.shipment.verification_due_at
  cash.surprise_count.due
  cash_surprise_count.due
  insider_report.due
  privacy.annual_notice_due_at
  privacy.board_report_due_at
  privacy.optout_propagation_due_at
  rate_sheet.refresh_due_at
  steering_review.due

## Real unregistered actions (96) — register in x-event-types or normalize:
  aan.queued
  access.review_due
  ad.accessibility_check
  alert.dq_variance
  alert.facility_readiness_aging
  alert.lar_band_change
  alert.mismatch_breach
  alert.survival_low
  alm.scenario_set
  audit.scope_change_documented
  aup.reacknowledged
  capital.buffer_assessed
  capital.icaap_report_id
  capital.quarterly_report_id
  capital.recovery_plan_draft
  capital.rwa_total
  capital.stress_report_id
  capital.tier1_total
  capital.tier2_total
  cash.custody.revoked
  cash.custody.rotated
  cash.enterprise_limit.warning
  cash.exception_register.summary
  cash.limit_block.alerted
  cash.limits_whitelist.sunset
  cash.load.overage
  cash.overshort.threshold_crossed
  cash.recon.variance
  cash.seal.mismatch
  cash.shipment.dispatched
  cash.surprise_count.variance
  cash_overshort.investigation
  cda.cap_breach_cured
  cda.funding_gate_evaluated
  cda.vendor_qualified
  cfp.deactivated
  cfp.execution_plan_documented
  collateral.headroom_computed
  collateral.headroom_rechecked
  concentration.computed
  correction.propagated
  credit_box.review_due
  crisis.team_convened
  document.required_set
  eps.erm_review.convened
  eps.it_committee.convened
  facility.badge_deactivated
  fair_lending.assessment_due
  funding.draw_order_deviated
  funding.source_unavailable
  insider.credit_threshold_exceeded
  interest.credited
  lar.band_recovered
  lar.computed
  legal_hold.schedule_resumed
  liquidity.report_due
  loan_application.decisioned
  loan_application.oral_adverse_decision
  loan_exception.analytics_due
  member.cease_flag_set
  mismatch.gap_computed
  mismatch.intraday_recomputed
  policy.review_due
  policy.review_lapsed
  portfolio.board_report_due
  portfolio.report_due
  privacy.optout_propagated
  privacy.state_request_fulfilled
  record.disposal_eligible
  record.legal_hold_flag
  record.media_converted
  record.retention_clock_set
  record.retention_expires_at
  record_class.unmatched
  records.contact_vacated
  repo.blocked_rule_violation
  repo.collateral_marked
  repo.collateral_revaluation_due
  repo.entered
  rwa.credit_calculated
  rwa.market_calculated
  rwa.operational_calculated
  sar.decision_file
  siem.source_silent
  stress.assumption_versioned
  stress.quarter_open
  survival.adhoc_computed
  survival.below_threshold
  survival.computed
  trade.blocked_prohibited
  training.completion_status
  vendor.annual_review_due
  vendor.edd_refresh_due
  vendor.incident_triaged
  verification.biometric_purged
  wholesale.listing_decisioned
